leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_regdef.h
/** \brief  Timer 0 Configuration */
typedef struct _Ifx_ERAY_T0C_Bits
{
    unsigned int T0RC:1;                    /**< \brief [0:0] Timer 0 Run Control (rwh) */
    unsigned int T0MS:1;                    /**< \brief [1:1] Timer 0 Mode Select (rw) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int T0CC:7;                    /**< \brief [14:8] Timer 0 Cycle Code (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int T0MO:14;                   /**< \brief [29:16] Timer 0 Macrotick Offset (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_T0C_Bits;

/** \brief  Timer 1 Configuration */
typedef struct _Ifx_ERAY_T1C_Bits
{
    unsigned int T1RC:1;                    /**< \brief [0:0] Timer 1 Run Control (rwh) */
    unsigned int T1MS:1;                    /**< \brief [1:1] Timer 1 Mode Select (rw) */
    unsigned int reserved_2:14;             /**< \brief \internal Reserved */
    unsigned int T1MC:14;                   /**< \brief [29:16] Timer 1 Macrotick Count (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_T1C_Bits;

/** \brief  Test Register 1 */
typedef struct _Ifx_ERAY_TEST1_Bits
{
    unsigned int WRTEN:1;                   /**< \brief [0:0] Write Test Register Enable (rw) */
    unsigned int ELBE:1;                    /**< \brief [1:1] External Loop Back Enable (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int TMC:2;                     /**< \brief [5:4] Test Multiplexer Control (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int AOA:1;                     /**< \brief [8:8] Activity on A (rh) */
    unsigned int AOB:1;                     /**< \brief [9:9] Activity on B (rh) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int RXA:1;                     /**< \brief [16:16] Read Channel A Receive Pin (rh) */
    unsigned int RXB:1;                     /**< \brief [17:17] Read Channel B Receive Pin (rh) */
    unsigned int TXA:1;                     /**< \brief [18:18] Read or Write to Channel A Transmit Pin (rwh) */
    unsigned int TXB:1;                     /**< \brief [19:19] Read or Write to Channel B Transmit Pin (rwh) */
    unsigned int TXENA:1;                   /**< \brief [20:20] Read or Write to Channel A Transmit Enable Pin (rwh) */
    unsigned int TXENB:1;                   /**< \brief [21:21] Read or Write to Channel B Transmit Enable Pin (rwh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int CERA:4;                    /**< \brief [27:24] Coding Error Report Channel A (rh) */
    unsigned int CERB:4;                    /**< \brief [31:28] Coding Error Report Channel B (rh) */
} Ifx_ERAY_TEST1_Bits;

/** \brief  Test Register 2 */
typedef struct _Ifx_ERAY_TEST2_Bits
{
    unsigned int RS:3;                      /**< \brief [2:0] RAM Select (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int SSEL:3;                    /**< \brief [6:4] Segment Select (rw) */
    unsigned int reserved_7:7;              /**< \brief \internal Reserved */
    unsigned int WRECC:1;                   /**< \brief [14:14] Write ECC Data Enable (rw) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_ERAY_TEST2_Bits;

/** \brief  Transmission Request Register 1 */
typedef struct _Ifx_ERAY_TXRQ1_Bits
{
    unsigned int TXR0:1;                    /**< \brief [0:0] Transmission Request 0 (0 = 0-31) (rh) */
    unsigned int TXR1:1;                    /**< \brief [1:1] Transmission Request 1 (1 = 0-31) (rh) */
    unsigned int TXR2:1;                    /**< \brief [2:2] Transmission Request 2 (2 = 0-31) (rh) */
    unsigned int TXR3:1;                    /**< \brief [3:3] Transmission Request 3 (3 = 0-31) (rh) */
    unsigned int TXR4:1;                    /**< \brief [4:4] Transmission Request 4 (4 = 0-31) (rh) */
    unsigned int TXR5:1;                    /**< \brief [5:5] Transmission Request 5 (5 = 0-31) (rh) */
    unsigned int TXR6:1;                    /**< \brief [6:6] Transmission Request 6 (6 = 0-31) (rh) */
    unsigned int TXR7:1;                    /**< \brief [7:7] Transmission Request 7 (7 = 0-31) (rh) */
    unsigned int TXR8:1;                    /**< \brief [8:8] Transmission Request 8 (8 = 0-31) (rh) */
    unsigned int TXR9:1;                    /**< \brief [9:9] Transmission Request 9 (9 = 0-31) (rh) */
    unsigned int TXR10:1;                   /**< \brief [10:10] Transmission Request 10 (10 = 0-31) (rh) */
    unsigned int TXR11:1;                   /**< \brief [11:11] Transmission Request 11 (11 = 0-31) (rh) */
    unsigned int TXR12:1;                   /**< \brief [12:12] Transmission Request 12 (12 = 0-31) (rh) */
    unsigned int TXR13:1;                   /**< \brief [13:13] Transmission Request 13 (13 = 0-31) (rh) */
    unsigned int TXR14:1;                   /**< \brief [14:14] Transmission Request 14 (14 = 0-31) (rh) */
    unsigned int TXR15:1;                   /**< \brief [15:15] Transmission Request 15 (15 = 0-31) (rh) */
    unsigned int TXR16:1;                   /**< \brief [16:16] Transmission Request 16 (16 = 0-31) (rh) */
    unsigned int TXR17:1;                   /**< \brief [17:17] Transmission Request 17 (17 = 0-31) (rh) */
    unsigned int TXR18:1;                   /**< \brief [18:18] Transmission Request 18 (18 = 0-31) (rh) */
    unsigned int TXR19:1;                   /**< \brief [19:19] Transmission Request 19 (19 = 0-31) (rh) */
    unsigned int TXR20:1;                   /**< \brief [20:20] Transmission Request 20 (20 = 0-31) (rh) */
    unsigned int TXR21:1;                   /**< \brief [21:21] Transmission Request 21 (21 = 0-31) (rh) */
    unsigned int TXR22:1;                   /**< \brief [22:22] Transmission Request 22 (22 = 0-31) (rh) */
    unsigned int TXR23:1;                   /**< \brief [23:23] Transmission Request 23 (23 = 0-31) (rh) */
    unsigned int TXR24:1;                   /**< \brief [24:24] Transmission Request 24 (24 = 0-31) (rh) */
    unsigned int TXR25:1;                   /**< \brief [25:25] Transmission Request 25 (25 = 0-31) (rh) */
    unsigned int TXR26:1;                   /**< \brief [26:26] Transmission Request 26 (26 = 0-31) (rh) */
    unsigned int TXR27:1;                   /**< \brief [27:27] Transmission Request 27 (27 = 0-31) (rh) */
    unsigned int TXR28:1;                   /**< \brief [28:28] Transmission Request 28 (28 = 0-31) (rh) */
    unsigned int TXR29:1;                   /**< \brief [29:29] Transmission Request 29 (29 = 0-31) (rh) */
    unsigned int TXR30:1;                   /**< \brief [30:30] Transmission Request 30 (30 = 0-31) (rh) */
    unsigned int TXR31:1;                   /**< \brief [31:31] Transmission Request 31 (31 = 0-31) (rh) */
} Ifx_ERAY_TXRQ1_Bits;

/** \brief  Transmission Request Register 2 */
typedef struct _Ifx_ERAY_TXRQ2_Bits
{
    unsigned int TXR32:1;                   /**< \brief [0:0] Transmission Request 32 (32 = 32-63) (rh) */
    unsigned int TXR33:1;                   /**< \brief [1:1] Transmission Request 33 (33 = 32-63) (rh) */
    unsigned int TXR34:1;                   /**< \brief [2:2] Transmission Request 34 (34 = 32-63) (rh) */
    unsigned int TXR35:1;                   /**< \brief [3:3] Transmission Request 35 (35 = 32-63) (rh) */
    unsigned int TXR36:1;                   /**< \brief [4:4] Transmission Request 36 (36 = 32-63) (rh) */
    unsigned int TXR37:1;                   /**< \brief [5:5] Transmission Request 37 (37 = 32-63) (rh) */
    unsigned int TXR38:1;                   /**< \brief [6:6] Transmission Request 38 (38 = 32-63) (rh) */
    unsigned int TXR39:1;                   /**< \brief [7:7] Transmission Request 39 (39 = 32-63) (rh) */
    unsigned int TXR40:1;                   /**< \brief [8:8] Transmission Request 40 (40 = 32-63) (rh) */
    unsigned int TXR41:1;                   /**< \brief [9:9] Transmission Request 41 (41 = 32-63) (rh) */
    unsigned int TXR42:1;                   /**< \brief [10:10] Transmission Request 42 (42 = 32-63) (rh) */
    unsigned int TXR43:1;                   /**< \brief [11:11] Transmission Request 43 (43 = 32-63) (rh) */
    unsigned int TXR44:1;                   /**< \brief [12:12] Transmission Request 44 (44 = 32-63) (rh) */
    unsigned int TXR45:1;                   /**< \brief [13:13] Transmission Request 45 (45 = 32-63) (rh) */
    unsigned int TXR46:1;                   /**< \brief [14:14] Transmission Request 46 (46 = 32-63) (rh) */
    unsigned int TXR47:1;                   /**< \brief [15:15] Transmission Request 47 (47 = 32-63) (rh) */
    unsigned int TXR48:1;                   /**< \brief [16:16] Transmission Request 48 (48 = 32-63) (rh) */
    unsigned int TXR49:1;                   /**< \brief [17:17] Transmission Request 49 (49 = 32-63) (rh) */
    unsigned int TXR50:1;                   /**< \brief [18:18] Transmission Request 50 (50 = 32-63) (rh) */
    unsigned int TXR51:1;                   /**< \brief [19:19] Transmission Request 51 (51 = 32-63) (rh) */
    unsigned int TXR52:1;                   /**< \brief [20:20] Transmission Request 52 (52 = 32-63) (rh) */
    unsigned int TXR53:1;                   /**< \brief [21:21] Transmission Request 53 (53 = 32-63) (rh) */
    unsigned int TXR54:1;                   /**< \brief [22:22] Transmission Request 54 (54 = 32-63) (rh) */
    unsigned int TXR55:1;                   /**< \brief [23:23] Transmission Request 55 (55 = 32-63) (rh) */
    unsigned int TXR56:1;                   /**< \brief [24:24] Transmission Request 56 (56 = 32-63) (rh) */
    unsigned int TXR57:1;                   /**< \brief [25:25] Transmission Request 57 (57 = 32-63) (rh) */
    unsigned int TXR58:1;                   /**< \brief [26:26] Transmission Request 58 (58 = 32-63) (rh) */
    unsigned int TXR59:1;                   /**< \brief [27:27] Transmission Request 59 (59 = 32-63) (rh) */
    unsigned int TXR60:1;                   /**< \brief [28:28] Transmission Request 60 (60 = 32-63) (rh) */
    unsigned int TXR61:1;                   /**< \brief [29:29] Transmission Request 61 (61 = 32-63) (rh) */
    unsigned int TXR62:1;                   /**< \brief [30:30] Transmission Request 62 (62 = 32-63) (rh) */
    unsigned int TXR63:1;                   /**< \brief [31:31] Transmission Request 63 (63 = 32-63) (rh) */
} Ifx_ERAY_TXRQ2_Bits;

